app/views/groups/show.html.erb

<p><strong>Members: </strong></p>
	<% @group.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "groups_users" ON "users"."id" = "groups_users"."user_id" WHERE "groups_users"."group_id" = $1  [["group_id", 1]]