app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  <% @posts.each do |post| %>
    <h4><%= link_to post.user.first_name, post_path(post) %></h4>