app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("commentable_id", "commentable_type", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"