app/controllers/groups_controller.rb

	def create
		@group = Group.new(group_params)
		current_user.groups << @group
---
INSERT INTO "groups" ("created_at", "created_by", "description", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 14 Mar 2014 21:19:53 UTC +00:00], ["created_by", 2], ["description", "sssss"], ["name", "sss"], ["updated_at", Fri, 14 Mar 2014 21:19:53 UTC +00:00]]
SELECT "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = $1  [["user_id", 1]]

	def show
		@group = Group.where(id: params[:id]).first
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 ORDER BY "groups"."id" ASC LIMIT 1

	def edit
		@group = Group.where(id: params[:id]).first
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 ORDER BY "groups"."id" ASC LIMIT 1

	def update
		@group = Group.where(id: params[:id]).first
		if @group.update(params[:group].permit(:name, :description))
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 ORDER BY "groups"."id" ASC LIMIT 1
UPDATE "groups" SET "name" = $1, "updated_at" = $2 WHERE "groups"."id" = 1  [["name", "Secret Group I think"], ["updated_at", Fri, 14 Mar 2014 19:33:19 UTC +00:00]]

	def destroy
		@group = Group.where(id: params[:id]).first
		@group.destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 4 ORDER BY "groups"."id" ASC LIMIT 1
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 4]]