app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"

  def show
		@post = Post.where(id: params[:id]).first
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 ORDER BY "posts"."id" ASC LIMIT 1

	def edit
		@post = Post.where(id: params[:id]).first
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 ORDER BY "posts"."id" ASC LIMIT 1

	def update
		@post = Post.where(id: params[:id]).first
		if @post.update(params[:post].permit(:title, :content))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 ORDER BY "posts"."id" ASC LIMIT 1
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = 1

	def destroy
		Post.delete(params[:id])
---
DELETE FROM "posts" WHERE "posts"."id" = 1